bench/out/redis-lock.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/hold-contention.js
        output: -

     scenarios: (100.00%) 2 scenarios, 150 max VUs, 1m5s max duration (incl. graceful stop):
              * single_seat: 1 iterations for each of 100 VUs (maxDuration: 30s, exec: singleSeat, gracefulStop: 30s)
              * spread: 50 looping VUs for 20s (exec: spread, startTime: 15s, gracefulStop: 30s)


running (0m01.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  14.0s     

running (0m02.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  13.0s     

running (0m03.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  12.0s     

running (0m04.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  11.0s     

running (0m05.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  10.0s     

running (0m06.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  09.0s     

running (0m07.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  08.0s     

running (0m08.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  07.0s     

running (0m09.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  06.0s     

running (0m10.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  05.0s     

running (0m11.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  04.0s     

running (0m12.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  03.0s     

running (0m13.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  02.0s     

running (0m14.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  01.0s     

running (0m15.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  00.0s     

running (0m16.0s), 050/150 VUs, 1268 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [   5% ] 50 VUs   01.0s/20s 

running (0m17.0s), 050/150 VUs, 2793 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  10% ] 50 VUs   02.0s/20s 

running (0m18.0s), 050/150 VUs, 4729 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  15% ] 50 VUs   03.0s/20s 

running (0m19.0s), 050/150 VUs, 6819 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  20% ] 50 VUs   04.0s/20s 

running (0m20.0s), 050/150 VUs, 8934 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  25% ] 50 VUs   05.0s/20s 

running (0m21.0s), 050/150 VUs, 11271 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  30% ] 50 VUs   06.0s/20s 

running (0m22.0s), 050/150 VUs, 13909 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  35% ] 50 VUs   07.0s/20s 

running (0m23.0s), 050/150 VUs, 16697 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  40% ] 50 VUs   08.0s/20s 

running (0m24.0s), 050/150 VUs, 19898 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  45% ] 50 VUs   09.0s/20s 

running (0m25.0s), 050/150 VUs, 23102 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  50% ] 50 VUs   10.0s/20s 

running (0m26.0s), 050/150 VUs, 26342 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  55% ] 50 VUs   11.0s/20s 

running (0m27.0s), 050/150 VUs, 29952 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  60% ] 50 VUs   12.0s/20s 

running (0m28.0s), 050/150 VUs, 33671 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  65% ] 50 VUs   13.0s/20s 

running (0m29.0s), 050/150 VUs, 36629 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  70% ] 50 VUs   14.0s/20s 

running (0m30.0s), 050/150 VUs, 40413 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  75% ] 50 VUs   15.0s/20s 

running (0m31.0s), 050/150 VUs, 44159 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  80% ] 50 VUs   16.0s/20s 

running (0m32.0s), 050/150 VUs, 47515 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  85% ] 50 VUs   17.0s/20s 

running (0m33.0s), 050/150 VUs, 50999 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  90% ] 50 VUs   18.0s/20s 

running (0m34.0s), 050/150 VUs, 54697 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  95% ] 50 VUs   19.0s/20s 

running (0m35.0s), 050/150 VUs, 57784 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [ 100% ] 50 VUs   20.0s/20s 


  █ TOTAL RESULTS 

    CUSTOM
    hold_conflict..................: 40296  1150.671488/s
    hold_win.......................: 17621  503.176054/s
    single_seat_latency............: avg=57.02ms med=57.67ms p(95)=62.1ms  p(99)=62.67ms  max=78.03ms 
    spread_latency.................: avg=10.69ms med=2.01ms  p(95)=38.1ms  p(99)=62.47ms  max=265.71ms

    HTTP
    http_req_duration..............: avg=13.24ms med=5.83ms  p(95)=39.32ms p(99)=63.42ms  max=265.71ms
      { expected_response:true }...: avg=25.1ms  med=21.88ms p(95)=49.45ms p(99)=77.87ms  max=265.71ms
    http_req_failed................: 53.34% 40296 out of 75537
    http_reqs......................: 75537  2156.995041/s

    EXECUTION
    iteration_duration.............: avg=17.37ms med=2.09ms  p(95)=65.17ms p(99)=101.78ms max=323.99ms
    iterations.....................: 57917  1653.847542/s
    vus............................: 50     min=0              max=50 
    vus_max........................: 150    min=150            max=150

    NETWORK
    data_received..................: 30 MB  865 kB/s
    data_sent......................: 24 MB  673 kB/s



running (0m35.0s), 000/150 VUs, 57917 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      ✓ [ 100% ] 50 VUs   20s