bench/out/v4-oversell.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/oversell.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
              * rush: 1 iterations for each of 1000 VUs (maxDuration: 1m0s, gracefulStop: 30s)


running (0m00.7s), 0498/1000 VUs, 502 complete and 0 interrupted iterations
rush   [  50% ] 1000 VUs  0m00.7s/1m0s  0502/1000 iters, 1 per VU


  █ THRESHOLDS 

    oversell_error
    ✓ 'count==0' count=0

    oversell_win
    ✓ 'count==10' count=10


  █ TOTAL RESULTS 

    CUSTOM
    oversell_conflict..............: 990    827.567528/s
    oversell_error.................: 0      0/s
    oversell_latency...............: avg=529.74ms med=516.88ms p(95)=873.36ms p(99)=1.06s   max=1.09s  
    oversell_win...................: 10     8.359268/s

    HTTP
    http_req_duration..............: avg=529.74ms med=516.88ms p(95)=873.36ms p(99)=1.06s   max=1.09s  
      { expected_response:true }...: avg=58.55ms  med=54.21ms  p(95)=81.12ms  p(99)=84.56ms max=85.42ms
    http_req_failed................: 99.00% 990 out of 1000
    http_reqs......................: 1000   835.926796/s

    EXECUTION
    iteration_duration.............: avg=677.63ms med=666.37ms p(95)=1.14s    p(99)=1.17s   max=1.19s  
    iterations.....................: 1000   835.926796/s
    vus............................: 499    min=499         max=499 
    vus_max........................: 1000   min=1000        max=1000

    NETWORK
    data_received..................: 435 kB 364 kB/s
    data_sent......................: 338 kB 283 kB/s



running (0m01.2s), 0000/1000 VUs, 1000 complete and 0 interrupted iterations
rush ✓ [ 100% ] 1000 VUs  0m01.2s/1m0s  1000/1000 iters, 1 per VU